'''
Леше в институте рассказали Малую теорему Ферма:﻿a^{p-1}\equiv 1 \ (\mod p)a p−1 ≡1 (modp)﻿, где ﻿p p﻿ — простое 
С помощью этого утверждения можно искать обратное по модулю. А именно, если ﻿a \not \equiv (\mod p),a ​ ≡(modp),﻿ то ﻿a^{-1}a \equiv 1 (\mod p), \ a^{-1} = a^{p-2}.a −1 a≡1(modp), a −1 =a p−2 .﻿
Теперь Леша решает домашнюю работу, в которой есть задача: надо посчитать ﻿\sum_{x=l}^r \frac{1}{x} (\mod p)∑ x=lr​  x1​ (modp)﻿.
Помогите ему с этим.


Формат входных данных
Вводится три числа ﻿l,r,p (1 \leq l \leq r < p, r-l \leq 2 \times 10^7, p \leq 10^9, p \ - \ простое \ число)l,r,p(1≤l≤r<p,r−l≤2×10 7 ,p≤10 9 ,p − простое число)﻿


Формат выходных данных
Выведите одно число — искомую сумму. 
'''

#PT. Пройденные тесты 2.

l, r, p = map(int, input().split())

sum_total = 0
for i in range(l,r+1):
    sum_total += (i**(p-2)) % p
    
print(sum_total % p)
