'''
У Кости есть бумажка, на которой написано ﻿nn﻿ чисел. Также у него есть возможность не больше, чем ﻿kk﻿ раз, взять любое число с бумажки, после чего закрасить одну из старых цифр, а на ее месте написать новую произвольную цифру.
На какое максимальное значение Костя сможет увеличить сумму всех чисел на листочке?


Формат входных данных
В первой строке входного файла даны два целых числа ﻿n,kn,k﻿ — количество чисел на бумажке и ограничение на число операций. 
﻿(1\leq n \leq 1000, 1 \leq k \leq 10^4)(1≤n≤1000,1≤k≤10 4 )﻿ .
Во второй строке записано ﻿nn﻿ чисел ﻿a_ia 
i​ ﻿ — числа на бумажке ﻿(1 \leq a_i \leq 10^9)(1≤a i​ ≤10 9 )﻿


Формат выходных данных 
В выходной файл выведите одно число — максимальную разность между конечной и начальной суммой.


Замечание 
В первом примере Костя может изменить две единицы на две девятки, в результате чего сумма чисел увеличится на ﻿1616﻿.
Во втором примере Костя меняет число ﻿8585﻿ на ﻿9595﻿.
В третьем примере можно ничего не менять.
Обратите внимание, что ответ может превышать вместимость ﻿3232﻿-битного типа данных.
'''

#OK. Пройденные тесты 40

def function():
    n, k = (int(num) for num in input().split())
    numbers = [int(x) for x in input().split()]

    operations = []

    for number in numbers:
        for i in range(len(str(number))):
            digit = str(number)[-(i + 1)]
            operation = 10 ** i * (9 - int(digit))
            operations.append(operation)

    operations.sort(reverse=True)
    return str(sum(operations[:k]))


if __name__ == "__main__":
    print(function())
