'''В школе перед Новым Годом устраивают игру в Тайного Санту. Каждому ученику ﻿ii﻿ выдается ученик ﻿a_ia i​ ﻿, которому он должен подарить подарок.
Костя, как администратор игры, определил каждому школьнику свое число ﻿a_ia i​ ﻿. Но потом его коллега Маша спросила: А правда ли, что если начать цепочку подарков от школьника ﻿11﻿ к школьнику ﻿a_1a 1 ﻿, потом ﻿a_{a1}a a1​
 ﻿ и так далее, то цепочка замкнется на школьнике ﻿11﻿, после того, как задействует всех остальных учеников ровно по одному разу?
Костя не знает, правда это или нет, но он собирается изменить ровно одно число ﻿a_ia i​ ﻿, чтобы получить конфигурацию, которая устроит Машу. Помогите ему с этим.


Формат входных данных
В первой строке находится натуральное число ﻿nn﻿ — количество школьников ﻿(2 \leq n \leq 10^5)(2≤n≤10 5 )﻿. В следующей строке находится ﻿nn﻿ натуральных чисел ﻿a_ia i​ ﻿ — ученик, который достался Тайному Санте с номером ﻿i (1 \leq a_i \leq n)i(1≤a i​ ≤n)﻿.


Формат выходных данных
В первой строке выведите два числа ﻿(1 \leq x , y \leq n , x \ne y)(1≤x,y≤n,x ​ =y)﻿ — номер ученика ﻿xx﻿, которому нужно изменить число ﻿a_xa x​ ﻿, и новое значение ﻿a_xa x​ ﻿.
Должно выполняться условие ﻿a_x \ne ya x​  ​ =y﻿. Если ответов несколько — выведите любой. 
Если сделать это невозможно — выведите ﻿<< -1 -1>><<−1−1>>﻿


Замечание
В первом примере хотя бы один школьник будет дарить подарок сам себе.
Во втором примере после изменения происходят передачи подарков ﻿1 \to 2 \to3 \to 11→2→3→1﻿.
'''

#PT. Пройденные тесты 2.

def function():
    pupils_num = int(input())
    santa_little_helpers = [int(x) for x in input().split()][:pupils_num]

    pupils_list = [pupil for pupil in range(1, pupils_num + 1)]

    right_order = [pup + 2 if pup != pupils_num - 1 else 1 for pup in range(pupils_num)]
    santa_little_helpers.append(santa_little_helpers.pop(0))
    expected = list(zip(pupils_list, right_order))
    given = list(zip(pupils_list, santa_little_helpers))

    diff = [(given[i][0], expected[i][1]) for i in range(pupils_num) if given[i] != expected[i]]

    if not diff:
        return "-1 -1"
    return "{0} {1}".format(diff[0][0], diff[0][1])


if __name__ == "__main__":
    print(function())
